In [513]:

import numpy as np
import pandas as pd
df= pd.read_csv('Data\Salaries.csv')

C:\Users\Admin\AppData\Local\Temp\ipykernel_8388\2399815996.py:3: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df= pd.read_csv('Data\Salaries.csv')

In [514]:
# Top 10 rows
df.head(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.0,8601.0,189082.74,NaN,316285.74,316285.74,2011,NaN,San Francisco,NaN
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.9,134426.14,NaN,315981.05,315981.05,2011,NaN,San Francisco,NaN
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576.96,0.0,51322.5,NaN,307899.46,307899.46,2011,NaN,San Francisco,NaN
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,NaN,303427.55,303427.55,2011,NaN,San Francisco,NaN
9,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.0,0.0,17115.73,NaN,302377.73,302377.73,2011,NaN,San Francisco,NaN

In [515]:
# Last 10 rows
df.tail(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148644,148645,Randy D Winn,"Stationary Eng, Sewage Plant",0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148645,148646,Carolyn A Wilson,Human Services Technician,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148646,148647,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148647,148648,Joann Anderson,Communications Dispatcher 2,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148648,148649,Leon Walker,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [516]:
#Shape
df.shape

(148654, 13)

In [517]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

# Basepay, Benefits, Notes and Status have null values

In [518]:
df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

In [519]:
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [520]:
df=df.drop(['Id','Notes','Agency','Status'], axis=1)

In [521]:
df.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [522]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      148654 non-null  object
 1   JobTitle          148654 non-null  object
 2   BasePay           148049 non-null  object
 3   OvertimePay       148654 non-null  object
 4   OtherPay          148654 non-null  object
 5   Benefits          112495 non-null  object
 6   TotalPay          148654 non-null  float64
 7   TotalPayBenefits  148654 non-null  float64
 8   Year              148654 non-null  int64
dtypes: float64(2), int64(1), object(6)
memory usage: 10.2+ MB

In [523]:
df.describe()

            TotalPay  TotalPayBenefits           Year
count  148654.000000     148654.000000  148654.000000
mean    74768.321972      93692.554811    2012.522643
std     50517.005274      62793.533483       1.117538
min      -618.130000       -618.130000    2011.000000
25%     36168.995000      44065.650000    2012.000000
50%     71426.610000      92404.090000    2013.000000
75%    105839.135000     132876.450000    2014.000000
max    567595.430000     567595.430000    2014.000000

In [524]:
df.duplicated().sum()

3

In [525]:
df[df.duplicated()]

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
148650,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014
148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014
148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014

In [526]:
df=df.drop_duplicates()

In [527]:
df.shape

(148651, 9)

In [528]:
#No of unique Job Titles
df['JobTitle'].nunique()

2159

In [529]:
df['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

In [530]:
#Employees with Job title Captain

df.loc[df['JobTitle'].str.contains('CAPTAIN') |  df['JobTitle'].str.contains('captain')]['EmployeeName']

1            GARY JIMENEZ
2          ALBERT PARDINI
11       PATRICIA JACKSON
17         SEBASTIAN WONG
22          GEORGE GARCIA
               ...
8684        JEANNE SEYLER
10485          JANE SMITH
11198       KATHRYN BROWN
31297     MARCO CARNIGLIA
34124       JOHN FORBES-3
Name: EmployeeName, Length: 141, dtype: object

In [531]:
#Employees in fire department

df.loc[df['JobTitle'].str.contains(pat='fire') |  df['JobTitle'].str.contains(pat='FIRE')]['EmployeeName']

4           PATRICK GARDNER
6                 ALSON LEE
8            MICHAEL MORRIS
9        JOANNE HAYES-WHITE
10            ARTHUR KENNEY
                ...
34790       CHARLES JOHNSON
34927         THOMAS LEEPER
35811         ROBERTO LUCHA
36076           DEBRA TANIS
36153         ROCK CRAWFORD
Name: EmployeeName, Length: 1459, dtype: object

In [532]:
#Replace 'Not Provided' in the EmployeeName' Column to NaN.
#print(df['EmployeeName'].unique())
df['EmployeeName'].replace('Not provided', 'NaN', inplace=True)
#print(df['EmployeeName'].unique())

In [533]:
#print(df['BasePay'])

# Remove the rows where BasePay value type is not correct

df=df[df['BasePay']!='Not Provided']# Return only those rows where base pay is not equal to 'Not Provided' value
# can be written as df = df[df.BasePay != 'Not Provided']

print(type(df['BasePay'])) # we got object type as objet, we got error while finding max , min, first convert it to float type
df['BasePay']=df['BasePay'].astype('float') # convert column to data type float
# we got object type as objet, we got error while finding max , min, first convert it to float type
print(df['BasePay'])

<class 'pandas.core.series.Series'>
0         167411.18
1         155966.02
2         212739.13
3          77916.00
4         134401.60
            ...
148645         0.00
148647         0.00
148648         0.00
148649         0.00
148653         0.00
Name: BasePay, Length: 148650, dtype: float64

In [534]:
# Calculate max, min, average 
print(df['BasePay'].min())
print(df['BasePay'].max())
print(df['BasePay'].mean())

-166.01
319275.01
66325.4488404877

In [535]:
#  None and Nan are considered missing values
df[df['EmployeeName']=='ALBERT PARDINI']['JobTitle']
#df['EmployeeName']=='ALBERT PARDINI'
#df.loc(df['EmployeeName']=='ALBERT PARDINI') # why error in this code?

2    CAPTAIN III (POLICE DEPARTMENT)
Name: JobTitle, dtype: object

In [536]:
df[df['EmployeeName']=='ALBERT PARDINI']['TotalPayBenefits']

2    335279.91
Name: TotalPayBenefits, dtype: float64

In [537]:
df[df['EmployeeName']=='ALBERT PARDINI']

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011

In [538]:
df[df['Year']==2011]

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.9,NaN,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.0,182234.59,NaN,326373.19,326373.19,2011
...,...,...,...,...,...,...,...,...,...
36154,SERENA HUGHES,SWIMMING INSTRUCTOR/POOL LIFEGUARD,0.00,0.0,4.17,NaN,4.17,4.17,2011
36155,JOE BROWN JR,TRANSIT OPERATOR,0.00,0.0,0.3,NaN,0.30,0.30,2011
36156,PAULETTE ADAMS,"STATIONARY ENGINEER, WATER TREATMENT PLANT",0.00,0.0,0.0,NaN,0.00,0.00,2011
36157,KAUKAB MOHSIN,TRANSIT OPERATOR,0.00,0.0,0.0,NaN,0.00,0.00,2011
36158,JOSEPHINE MCCREARY,MANAGER IV,0.00,0.0,0.0,NaN,0.00,0.00,2011

In [539]:
#df.groupby('Year')['BasePay'].mean()
#df.groupby('Year')['BasePay'].apply(lambda x:x) # To see the gropued by data for column Base Pay
#df.groupby('Year').apply(lambda x:x) # To see the gropued by data all data
#df.groupby('Year')[['BasePay']].apply(lambda x:x) # Gives Data Frame object
#df.groupby('Year')['BasePay'].apply(lambda x:x) # Gives Series object

# # Avergae Base pay per Year for al employees
df.groupby('Year')[['BasePay']].mean()

           BasePay
Year
2011  63595.956517
2012  65436.406857
2013  69630.030216
2014  66564.421924

In [540]:
# Avergae Base pay per Job Title for all employess
df.groupby('JobTitle')[['BasePay']].mean()

                                                     BasePay
JobTitle
ACCOUNT CLERK                                   43300.806506
ACCOUNTANT                                      46643.172000
ACCOUNTANT INTERN                               28732.663958
ACPO,JuvP, Juv Prob (SFERS)                     62290.780000
ACUPUNCTURIST                                   66374.400000
...                                                      ...
X-RAY LABORATORY AIDE                           47664.773077
X-Ray Laboratory Aide                           46086.387100
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS  52609.910000
Youth Comm Advisor                              39077.957500
ZOO CURATOR                                     43148.000000

[2158 rows x 1 columns]

In [541]:
df['BasePay'].max()

319275.01

In [542]:
#Name of The Person Having The Highest BasePay.
max=df['BasePay'].max()
df[df['BasePay']==max]['EmployeeName'] # How to get value

72925    Gregory P Suhr
Name: EmployeeName, dtype: object

In [543]:
#Average BasePAy of Employee HAving Job Title ACCOUNTANT#
df[df['JobTitle'].str.contains('ACCOUNTANT') | df['JobTitle'].str.contains('Accountant')]['BasePay'].mean()

72245.57241071429

In [544]:
df['JobTitle']

0         GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                        CAPTAIN III (POLICE DEPARTMENT)
2                        CAPTAIN III (POLICE DEPARTMENT)
3                   WIRE ROPE CABLE MAINTENANCE MECHANIC
4           DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
                               ...
148645                         Human Services Technician
148647                       Communications Dispatcher 2
148648                                         Custodian
148649                                         Custodian
148653                        Counselor, Log Cabin Ranch
Name: JobTitle, Length: 148650, dtype: object

In [545]:
#Top 5 Most Common Jobs.
#df.groupby('JobTitle')[['JobTitle']].value_counts().idxmax()
jobs=pd.DataFrame(df.groupby('JobTitle')[['JobTitle']].value_counts()).sort_values('count', ascending=False)
jobs[0:5].index
#print(jobs.idxmax())
#print(df.groupby('JobTitle')[['JobTitle']].value_counts().idxmax())

Index(['Transit Operator', 'Special Nurse', 'Registered Nurse',
       'Public Svc Aide-Public Works', 'Police Officer 3'],
      dtype='object', name='JobTitle')

In [546]:
#top 5 highest-paid employees (based on TotalPay).
df.sort_values('TotalPay', ascending=False)['EmployeeName'][0:5]

0         NATHANIEL FORD
1           GARY JIMENEZ
110531       David Shinn
110532        Amy P Hart
36159     Gary Altenberg
Name: EmployeeName, dtype: object

In [547]:
 #total number of employees in each department 
df_group_by_dept=df.groupby('JobTitle')[['EmployeeName']].agg('count')
df_group_by_dept

                                                EmployeeName
JobTitle
ACCOUNT CLERK                                             83
ACCOUNTANT                                                 5
ACCOUNTANT INTERN                                         48
ACPO,JuvP, Juv Prob (SFERS)                                1
ACUPUNCTURIST                                              1
...                                                      ...
X-RAY LABORATORY AIDE                                     26
X-Ray Laboratory Aide                                    100
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS             1
Youth Comm Advisor                                         4
ZOO CURATOR                                                1

[2158 rows x 1 columns]

In [548]:
#employee who has worked the most number of years
df['Experience']=2024-df['Year']
df.sort_values('Experience', ascending=False)
max_exp=df['Experience'].max()
df[df['Experience']==max_exp]['EmployeeName']

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
36154         SERENA HUGHES
36155          JOE BROWN JR
36156        PAULETTE ADAMS
36157         KAUKAB MOHSIN
36158    JOSEPHINE MCCREARY
Name: EmployeeName, Length: 36159, dtype: object

In [549]:
#employee with the lowest BasePay
df.sort_values('BasePay')
df[0:1].EmployeeName

0    NATHANIEL FORD
Name: EmployeeName, dtype: object